bench/scale_fio/fio_logs/ext4/write_128k_8.log
write: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
...
fio-3.16
Starting 8 processes

write: (groupid=0, jobs=8): err= 0: pid=226368: Thu Oct  9 16:32:38 2025
  write: IOPS=4058, BW=507MiB/s (532MB/s)(8192MiB/16149msec); 0 zone resets
    clat (usec): min=20, max=416770, avg=783.09, stdev=4820.90
     lat (usec): min=21, max=416777, avg=784.48, stdev=4821.03
    clat percentiles (usec):
     |  1.00th=[   26],  5.00th=[   35], 10.00th=[   36], 20.00th=[   38],
     | 30.00th=[   39], 40.00th=[   41], 50.00th=[   44], 60.00th=[   60],
     | 70.00th=[  112], 80.00th=[  120], 90.00th=[  131], 95.00th=[  167],
     | 99.00th=[29492], 99.50th=[36963], 99.90th=[41157], 99.95th=[41681],
     | 99.99th=[43779]
   bw (  MiB/s): min=  510, max= 9478, per=100.00%, avg=1283.69, stdev=305.31, samples=100
   iops        : min= 4084, max=75824, avg=10269.37, stdev=2442.50, samples=100
  lat (usec)   : 50=54.69%, 100=7.71%, 250=35.10%, 500=0.01%
  lat (msec)   : 2=0.01%, 50=2.48%, 500=0.01%
  cpu          : usr=0.10%, sys=4.79%, ctx=4741, majf=0, minf=98
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,65536,0,8 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=507MiB/s (532MB/s), 507MiB/s-507MiB/s (532MB/s-532MB/s), io=8192MiB (8590MB), run=16149-16149msec

Disk stats (read/write):
  nvme1n1: ios=5/17407, merge=0/5, ticks=6/5992284, in_queue=5992839, util=98.75%