bench/scale_fio/fio_logs/ext4/write_4k_16.log
write: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.16
Starting 16 processes

write: (groupid=0, jobs=16): err= 0: pid=220696: Thu Oct  9 16:30:53 2025
  write: IOPS=109k, BW=427MiB/s (448MB/s)(16.0GiB/38328msec); 0 zone resets
    clat (nsec): min=631, max=739865k, avg=95733.64, stdev=2684017.72
     lat (nsec): min=651, max=739866k, avg=95826.44, stdev=2684020.67
    clat percentiles (nsec):
     |  1.00th=[     876],  5.00th=[    1256], 10.00th=[    1592],
     | 20.00th=[    2256], 30.00th=[    3056], 40.00th=[    4048],
     | 50.00th=[    4192], 60.00th=[    4512], 70.00th=[    4704],
     | 80.00th=[    5152], 90.00th=[    6368], 95.00th=[    8032],
     | 99.00th=[   11840], 99.50th=[   15424], 99.90th=[45875200],
     | 99.95th=[49545216], 99.99th=[65798144]
   bw (  KiB/s): min= 3222, max=10487392, per=100.00%, avg=668637.09, stdev=90505.48, samples=798
   iops        : min=  804, max=2621848, avg=167158.69, stdev=22626.38, samples=798
  lat (nsec)   : 750=0.12%, 1000=1.77%
  lat (usec)   : 2=14.70%, 4=20.58%, 10=60.92%, 20=1.52%, 50=0.19%
  lat (usec)   : 100=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 20=0.01%, 50=0.14%, 100=0.04%
  lat (msec)   : 250=0.01%, 500=0.01%, 750=0.01%
  cpu          : usr=0.38%, sys=3.41%, ctx=14134, majf=0, minf=204
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,4194304,0,16 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=427MiB/s (448MB/s), 427MiB/s-427MiB/s (448MB/s-448MB/s), io=16.0GiB (17.2GB), run=38328-38328msec

Disk stats (read/write):
  nvme1n1: ios=11/33536, merge=0/17, ticks=12/16936619, in_queue=16939112, util=99.46%