bench/scale_fio/fio_logs/ext4/write_4k_2.log
write: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.16
Starting 2 processes

write: (groupid=0, jobs=2): err= 0: pid=219797: Thu Oct  9 16:29:43 2025
  write: IOPS=96.9k, BW=379MiB/s (397MB/s)(2048MiB/5409msec); 0 zone resets
    clat (nsec): min=699, max=1428.9k, avg=955.22, stdev=2020.35
     lat (nsec): min=717, max=1430.3k, avg=974.81, stdev=2022.89
    clat percentiles (nsec):
     |  1.00th=[  732],  5.00th=[  748], 10.00th=[  764], 20.00th=[  788],
     | 30.00th=[  812], 40.00th=[  836], 50.00th=[  852], 60.00th=[  876],
     | 70.00th=[  916], 80.00th=[ 1020], 90.00th=[ 1304], 95.00th=[ 1464],
     | 99.00th=[ 1912], 99.50th=[ 2352], 99.90th=[ 4704], 99.95th=[ 5344],
     | 99.99th=[25728]
  lat (nsec)   : 750=6.08%, 1000=72.44%
  lat (usec)   : 2=20.69%, 4=0.44%, 10=0.35%, 20=0.01%, 50=0.01%
  lat (usec)   : 100=0.01%
  lat (msec)   : 2=0.01%
  cpu          : usr=1.39%, sys=5.39%, ctx=26, majf=0, minf=24
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,524288,0,2 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=379MiB/s (397MB/s), 379MiB/s-379MiB/s (397MB/s-397MB/s), io=2048MiB (2147MB), run=5409-5409msec

Disk stats (read/write):
  nvme1n1: ios=1/4169, merge=0/2, ticks=2/1887814, in_queue=1887832, util=93.41%