bench/scale_fio/fio_logs/ext4/write_4k_4.log
write: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.16
Starting 4 processes

write: (groupid=0, jobs=4): err= 0: pid=219938: Thu Oct  9 16:29:53 2025
  write: IOPS=106k, BW=413MiB/s (433MB/s)(4096MiB/9927msec); 0 zone resets
    clat (nsec): min=635, max=1341.2k, avg=1010.69, stdev=2519.23
     lat (nsec): min=655, max=1342.5k, avg=1031.05, stdev=2522.46
    clat percentiles (nsec):
     |  1.00th=[  740],  5.00th=[  772], 10.00th=[  780], 20.00th=[  804],
     | 30.00th=[  820], 40.00th=[  844], 50.00th=[  868], 60.00th=[  916],
     | 70.00th=[  988], 80.00th=[ 1096], 90.00th=[ 1384], 95.00th=[ 1592],
     | 99.00th=[ 2288], 99.50th=[ 3984], 99.90th=[ 5088], 99.95th=[ 8512],
     | 99.99th=[26752]
  lat (nsec)   : 750=1.52%, 1000=69.68%
  lat (usec)   : 2=27.20%, 4=1.10%, 10=0.45%, 20=0.01%, 50=0.04%
  lat (msec)   : 2=0.01%
  cpu          : usr=0.58%, sys=3.68%, ctx=3600, majf=0, minf=51
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1048576,0,4 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=413MiB/s (433MB/s), 413MiB/s-413MiB/s (433MB/s-433MB/s), io=4096MiB (4295MB), run=9927-9927msec

Disk stats (read/write):
  nvme1n1: ios=4/8832, merge=0/4, ticks=5/2892517, in_queue=2892842, util=96.96%